[
  {
    "slug": "/081221_smallbusiness",
    "title": "Lib Dem tax cut call on Small Business Saturday",
    "date": "00:01 4-12-2021",
    "author": "Sam Oliver",
    "content": "\n            <p><img src=\"https://d3n8a8pro7vhmx.cloudfront.net/cambridgelibdems/pages/5234/attachments/original/1638993411/key_business.jpg?1638993411\" alt=\"\" width=\"800\"></p>\n<p><strong>On Small Business Saturday, local Lib Dems are calling for small businesses in Cambridgeshire to be given a tax cut, saving them an average of £5,000. This tax cut would help businesses across the country including local restaurants suffering from Christmas cancellations following new Covid restrictions, and businesses which figures reveal are set to be hit by the National Insurance tax rise.</strong></p><p class=\"\">Local Liberal Democrats have backed the proposals which would benefit 14,500 small businesses and entrepreneurs in Cambridgeshire from cafes and restaurants to high street shops. The proposed tax cut would save small businesses an average of £5,000 a year by aiding them with staff costs. It would be achieved by quadrupling the Employment Allowance to £16,000 for a period of two years. This would allow a small business to employ five people on an average salary without paying any National Insurance contributions. 1.1 million businesses would be eligible for this tax cut, which would save them an estimated £5.5 billion next year.</p>\n<p class=\"\">It comes as a record number of small businesses say they are struggling with rising costs whilst new Covid restrictions loom, according to a recent survey by the Federation of Small Businesses. Local restaurants have also reported a surge in Christmas bookings being cancelled, setting owners back thousands of pounds.&nbsp;</p>\n<p class=\"\">Meanwhile, the Conservatives have announced small businesses will have to pay more National Insurance contributions in the new year, despite facing a tough winter. Research by the House of Commons Library has shown the Conservative plans are set to hit an estimated 13,000 local businesses in Cambridgeshire with a &nbsp;£32.6 million<strong> </strong>tax bombshell.&nbsp;</p>\n<p class=\"\">In South Cambridgeshire some 2,100 small businesses would benefit from the proposed cut, whilst 2,000 are set to be adversely affected by the Tory NI rise with a £5 million hike in tax. The Lib Dem run South Cambridgeshire District Council is also providing a welcome boost for South Cambs businesses with a Christmas Market on Sunday 5th December, giving people a great opportunity to support their local businesses this festive season.</p>\n<p class=\"\"><strong>Speaking as the spokesperson for South Cambridgeshire Liberal Democrats Pippa said: </strong></p>\n<p class=\"\"><em>“Our local businesses are the backbone of our community and the engine of Covid recovery and must be helped through a tough winter. Businesses across the region are struggling with mounting bills and worries about the impact of the new Covid variant in the coming weeks. It is disgraceful that they are being forced to pay even more tax by this Conservative government. We need to help them now with a big and bold offer. That is why I am backing calls for our local businesses to receive a tax cut.”</em></p>\n<p class=\"\"><strong>Leader of the Liberal Democrats, Ed Davey MP, said:</strong></p>\n<p class=\"\"><em>“Cafes, shops and start-ups are all looking at this winter with dread, yet all Boris Johnson can muster up is a massive new tax bill. The Conservatives must be living on another planet if they think the answer to business owners’ problems is to put up their taxes.&nbsp;</em></p>\n<p class=\"\"><em> “This country was promised tax cuts by the Conservatives, but yet again their promises have been proven not to be worth the paper they are written on.</em></p>\n<p class=\"\"><em>“People and businesses need help now. I want to give our dedicated local business owners and entrepreneurs a helping hand, and to truly unleash Britain’s potential.”</em></p>\n                      ",
    "featuredImageURL": "https://assets.nationbuilder.com/cambridgelibdems/pages/5234/attachments/original/1638993411/key_business.jpg?1638993411",
    "imageTitle": "Lib Dem tax cut call on Small Business Saturday",
    "imageAlt": "Lib Dem tax cut call on Small Business Saturday",
    "excerpt": "On Small Business Saturday, local Lib Dems are calling for small businesses in Cambridgeshire to be given a tax cut, saving them an average of £5,000",
    "notes": "Imported from Cambridgeshire Nationbuilder",
    "mediaName": "key_business.jpg"
  }
]